## production: github
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**❌ &nbsp; Terraform Plan:** `failed`
**❌ &nbsp; Conftest:** `failed` 

<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # github_actions_secret.account_id will be created
  + resource "github_actions_secret" "account_id" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "notification-terraform"
      + secret_name     = "PRODUCTION_ACCOUNT_ID"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.aws_access_key_id[0] will be created
  + resource "github_actions_secret" "aws_access_key_id" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "notification-terraform"
      + secret_name     = "PRODUCTION_AWS_ACCESS_KEY_ID"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.aws_secret_access_key[0] will be created
  + resource "github_actions_secret" "aws_secret_access_key" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "notification-terraform"
      + secret_name     = "PRODUCTION_AWS_SECRET_ACCESS_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.manifests_account_id will be created
  + resource "github_actions_secret" "manifests_account_id" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "notification-manifests"
      + secret_name     = "PRODUCTION_ACCOUNT_ID"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.manifests_aws_access_key_id[0] will be created
  + resource "github_actions_secret" "manifests_aws_access_key_id" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "notification-manifests"
      + secret_name     = "PRODUCTION_AWS_ACCESS_KEY_ID"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.manifests_aws_secret_access_key[0] will be created
  + resource "github_actions_secret" "manifests_aws_secret_access_key" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "notification-manifests"
      + secret_name     = "PRODUCTION_AWS_SECRET_ACCESS_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.manifests_cache_clear_client_secret[0] will be created
  + resource "github_actions_secret" "manifests_cache_clear_client_secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "notification-manifests"
      + secret_name     = "PRODUCTION_CACHE_CLEAR_CLIENT_SECRET"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.manifests_new_relic_api_key[0] will be created
  + resource "github_actions_secret" "manifests_new_relic_api_key" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "notification-manifests"
      + secret_name     = "PRODUCTION_NEW_RELIC_API_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.manifests_notify_dev_slack_webhook[0] will be created
  + resource "github_actions_secret" "manifests_notify_dev_slack_webhook" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "notification-manifests"
      + secret_name     = "SLACK_WEBHOOK"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.manifests_op_service_account_token[0] will be created
  + resource "github_actions_secret" "manifests_op_service_account_token" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "notification-manifests"
      + secret_name     = "OP_SERVICE_ACCOUNT_TOKEN_PRODUCTION"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.manifests_openai_api_key[0] will be created
  + resource "github_actions_secret" "manifests_openai_api_key" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "notification-manifests"
      + secret_name     = "OPENAI_API_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.notify_dev_slack_webhook[0] will be created
  + resource "github_actions_secret" "notify_dev_slack_webhook" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "notification-terraform"
      + secret_name     = "NOTIFY_PRODUCTION_SLACK_WEBHOOK"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.op_service_account_token[0] will be created
  + resource "github_actions_secret" "op_service_account_token" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "notification-terraform"
      + secret_name     = "OP_SERVICE_ACCOUNT_TOKEN_PRODUCTION"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.openai_api_key[0] will be created
  + resource "github_actions_secret" "openai_api_key" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "notification-terraform"
      + secret_name     = "OPENAI_API_KEY"
      + updated_at      = (known after apply)
    }

Plan: 14 to add, 0 to change, 0 to destroy.

Error: error reading repository vulnerability alerts: GET https://api.github.com/repos/cds-snc/notification-terraform/vulnerability-alerts: 403 Resource not accessible by integration []

time=2024-11-21T18:46:10Z level=error msg=terraform invocation failed in /home/runner/work/notification-terraform/notification-terraform/env/production/github/.terragrunt-cache/lRYVKugs3AwKyNhWS5assl0M3X8/otNjPEaGW-4SZcUM-28oiXiKtfo/aws/github error=[/home/runner/work/notification-terraform/notification-terraform/env/production/github/.terragrunt-cache/lRYVKugs3AwKyNhWS5assl0M3X8/otNjPEaGW-4SZcUM-28oiXiKtfo/aws/github] exit status 1 prefix=[/home/runner/work/notification-terraform/notification-terraform/env/production/github] 
time=2024-11-21T18:46:10Z level=error msg=1 error occurred:
	* [/home/runner/work/notification-terraform/notification-terraform/env/production/github/.terragrunt-cache/lRYVKugs3AwKyNhWS5assl0M3X8/otNjPEaGW-4SZcUM-28oiXiKtfo/aws/github] exit status 1



```

</details>

